---
kind: property
id: P:Autodesk.Revit.DB.Material.SurfaceBackgroundPatternColor
zh: 材质、材料
source: html/e06ad303-e935-e851-207e-08748ba58d1b.htm
---
# Autodesk.Revit.DB.Material.SurfaceBackgroundPatternColor Property

**中文**: 材质、材料

The color of the material surface background pattern.

## Syntax (C#)
```csharp
public Color SurfaceBackgroundPatternColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null